[
    {"blog_id": 1, "blog_title": "Do doctors see patients as machines?", "blog_feature_image_url": "https://i.ibb.co/3SJb5Fg/blog1.jpg", "blog_content": "While working at a community hospital in the Midwest in the early 2000s, I came to know Walter Stephenson (name changed), who was under my medical care during a lengthy recovery from multiple complications related to Diabetes. 40-year-old Walter was going through a stressful phase of his life, which included a life-threatening infection in his leg that eventually required amputation, kidney failure necessitating dialysis, and other psychological problems including anxiety, depression, and insomnia. Once a vivacious and lively patient, Walter seemed to be sinking into himself as he tried to come to terms with a pending amputation. One afternoon during his stay I asked, as I always did, if he had any questions. He nodded, gathering his thoughts as I stepped to the end of his bed to face him.", "blog_author": "Sabbir"},
    {"blog_id": 2, "blog_title": "Some health issues should not be evaluated in the office", "blog_feature_image_url": "https://i.ibb.co/DbRPnfy/blog2.jpg", "blog_content": "I received a phone call from an elderly gentleman who was closer to ninety years of age than 80, was taking an aspirin, and had just suffered a fall and hit his head. He did not know why or how he fell. He asked for an appointment the same day to check me out. My staff asked all the pertinent questions and immediately brought the information to me. After reviewing it, I felt for his safety his best course of action was to immediately call 911 (or have us do it) and go to our local emergency department for evaluation. The patient takes daily aspirins to prevent a second heart attack or stroke.", "blog_author": "Sabbir"},
    {"blog_id": 3, "blog_title": "CT Scan: 5 Facts to Help You Prepare for Your Exam", "blog_feature_image_url": "https://i.ibb.co/WcPr5Cn/blog3.jpg", "blog_content": "A CT scan is state-of-the-art medical imaging that give doctors a detailed view into your body. CT scans, like x-rays, use ionizing radiation to create a set of images from many different angles. These images are like “slices” that, when put together, make a single, highly detailed image. CT scans are used for anything from pinpointing the location of a tumor to checking for internal bleeding after trauma. Doctors use CTs to plan surgeries and other medical procedures as well as monitor conditions and treatments. The “CT” in “CT scan” stands for computerized tomography. The scan is controlled by a computer, hence “computerized.” “Tomography” comes from the Greek word “tomos,” which means “slice” or “section.”", "blog_author": "Sabbir"},
    {"blog_id": 4, "blog_title": "When the family wants to speak to the doctor", "blog_feature_image_url": "https://i.ibb.co/jLmc5mR/blog4.jpg", "blog_content": "Being a doctor is often more about talking to people and communicating than it is about the scientific practice of medicine. This is something that is unfortunately not taught enough in medical school, and it’s left to newly qualified doctors to realize very quickly as they start their careers. Throughout the busy and hectic day of any hospital-based physician—no matter what their specialty—one of the most common requests we hear from nurses is whether patients’ family members can also speak with us. These requests will always be attempted to be met with duty of service. Occasionally, however (and this is the absolute minority), I’ve encountered physicians who shrug their shoulders and wonder, “What does the family want?”, or “I spent so much time talking with the patient, why does the family need to speak with me now?”. Some of these feelings can be legitimate, especially if the doctor feels rushed and under pressure to move on to the next patient. But it personally makes me internally shudder if I see any doctor who doesn’t feel it their duty to talk with their patient’s family.", "blog_author": "Sabbir"},
    {"blog_id": 5, "blog_title": "Why storytelling is critical in medicine", "blog_feature_image_url": "https://i.ibb.co/CQNfFXm/blog5.jpg", "blog_content": "I love stories, either told, written, or listened to. Songs tell stories, as does art. Blogs such as the rich content open so many doors for rich conversations. Telling stories is part of who I am. My father loved to tell them, as did my grandfather, whose name I took. They were called bull-sh*tters – and perhaps some refer to me that way at times. In medicine, I find storytelling to be critical. Each time we present a case, we are telling a story. Those residents and students who can present a case to me in a way that draws me in while giving me the necessary facts, but goes the next step that allows me to see that person in their life are the ones I know will be amazing doctors.", "blog_author": "Sabbir"},
    {"blog_id": 6, "blog_title": "The value of in-person feedback", "blog_feature_image_url": "https://i.ibb.co/WnqpsWz/blog6.jpg", "blog_content": "As I progress further in my medical career, I often feel that there are expectations of me that I have never been trained for. Teaching and feedback are large parts of my training that I do not always feel we are adequately prepared for. Feedback constitutes a large part of how we become better physicians. However, this commonly comes in the form of written feedback, and there is limited time and opportunity in many cases to give feedback personally to someone. However, this is uniquely valuable for four reasons:", "blog_author": "Sabbir"}
]